{"id":"05cb94ba-0486-4cfe-959e-09185d8a157a","updated_at":"2025-09-14T10:51:56.106Z","updated_by":"elastic","created_at":"2025-09-14T10:51:56.106Z","created_by":"elastic","name":"C1 – Boot --> Beacon (10m)","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"Checking Beacons","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"4f54eb9d-a23f-4dd9-9d20-bc8ae03b4257","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"sequence with maxspan=10m\n  [ any where\n      event.module == \"wazuh\" and\n      ( rule.id == \"910120\" or rule.description like \"Android BOOT_COMPLETED*\" )\n  ]\n  [ any where\n      event.module == \"suricata\" and\n      (\n        user_agent.original : \"Locker-Beacon/1.0 (SIMULATION)\"\n      )\n  ]","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
